<?PHP

$help_txt[]="<u>Подсказки</u>";
$help_txt[]="";
$help_txt[]="/home - возврат на главное меню и сброс всех временных данных и позиции";
$help_txt[]="";
$help_txt[]="/add - добавление событий. Во время этой операции проводится некоторый анализ данных и сообщается о необходимости проведения тех. обслуживания или продлении страховки. При добавлении заправки (километраж и объем) вычисляется ориентировочный расход топлива";
$help_txt[]="";
$help_txt[]="/read - просмотр событий за последний год (заправки - за два месяц)";
$help_txt[]="";
$help_txt[]="/stop - удалить пользователя и все связанные с ним данные (пока не реализовано)";
$help_txt[]="";
$help_txt[]="/info - о проекте";

?>