<?PHP

$info_txt[]="<u>О проекте</u>";
$info_txt[]="";
$info_txt[]="Главное! Бот находится в разработке. Возможны непредвиденные сбои и ошибки.\r\nДанные пользователя берутся один раз при регистрации из Telegram\r\n\r\nВы можете в любое время 'очистить историю' чата с ботом. Все данные при этом сохраняются в базе. Удаление данных будет возможно только через команду /stop";
$info_txt[]="";
$info_txt[]="<b>реализовано:</b>";
$info_txt[]="";
$info_txt[]="| - добавление событий;";
$info_txt[]="| - некоторый анализ данных для формирования сообщений о необходимости проведения технического обслуживания или продлении страховки (только во время добавления любого из событий или при использовании команды /remind исходя из километража и текущей даты;";
$info_txt[]="| - при добавлении заправки (километраж и объем) вычисляется ориентировочный расход топлива за последнее время;";
$info_txt[]="| - просмотр событий за последний год (заправки - за два месяц)";
$info_txt[]="";
$info_txt[]="<b>в планах:</b>";
$info_txt[]="";
$info_txt[]="| - сохранение сообщения из главного меню в качестве обратной связи для разработчика;";
$info_txt[]="| - реализовать возможноcть при добавлении событий пропускать не критичные вопросы;";
$info_txt[]="| - сделать проверки на корректность данных ввода (сейчас вместо чисел и дат может сохраняться текст);";
$info_txt[]="| - функция корректировки данных ТС;";
$info_txt[]="| - для получения более полной информации о имеющихся событиях планируется генерировать табличку и адрес к ней через Web;";
$info_txt[]="| - сохранение фото и гео-данных;";
$info_txt[]="| - добавление любых не классифицированных событий - ДТП, тюннинг или любое другое;";
$info_txt[]="| - функция удаления пользователя и всех связанных с ним данных";
$info_txt[]="";
$info_txt[]="<b>под сомнением:</b>";
$info_txt[]="";
$info_txt[]="| - подсчёт расходов за месяц и за год;";
$info_txt[]="| - возможность вести дневник одного ТС от нескольких аккаунтов Telegram";
$info_txt[]="";
$info_txt[]="<b>монетизация:</b>";
$info_txt[]="";
$info_txt[]="| - до появления обременительных расходов на содержание и развитие бота монетизация не планируется. В дальнейшем возможно появление запроса на донаты";
$info_txt[]="";
$info_txt[]="@cybittheir_trv  - любая обратная связь по теме этого бота приветствуется";

?>